# BAF500 Financial Database - Exercise 1

## Myokyung Han(Student ID : 20224230)

### 1. Data Download

### 2. Data Loading

In [1]:
import pandas as pd

In [2]:
pd.read_excel('./data/samsung_stock_price.xlsx')

               Unnamed: 0  Unnamed: 1 Unnamed: 2    Unnamed: 3
0                      날짜        종목코드        기업명  주가 2000-2022
1     2000-01-04T00:00:00  KRX:005930       삼성전자          6110
2     2000-01-05T00:00:00  KRX:005930       삼성전자          5580
3     2000-01-06T00:00:00  KRX:005930       삼성전자          5620
4     2000-01-07T00:00:00  KRX:005930       삼성전자          5540
...                   ...         ...        ...           ...
5468  2022-02-24T00:00:00  KRX:005930       삼성전자         71500
5469  2022-02-25T00:00:00  KRX:005930       삼성전자         71900
5470  2022-02-28T00:00:00  KRX:005930       삼성전자         72100
5471  2022-03-02T00:00:00  KRX:005930       삼성전자         72000
5472  2022-03-03T00:00:00  KRX:005930       삼성전자         72800

[5473 rows x 4 columns]

In [3]:
pd.read_excel('./data/samsung_stock_price.xlsx', skiprows=1)

                       날짜        종목코드   기업명  주가 2000-2022
0     2000-01-04T00:00:00  KRX:005930  삼성전자          6110
1     2000-01-05T00:00:00  KRX:005930  삼성전자          5580
2     2000-01-06T00:00:00  KRX:005930  삼성전자          5620
3     2000-01-07T00:00:00  KRX:005930  삼성전자          5540
4     2000-01-10T00:00:00  KRX:005930  삼성전자          5770
...                   ...         ...   ...           ...
5467  2022-02-24T00:00:00  KRX:005930  삼성전자         71500
5468  2022-02-25T00:00:00  KRX:005930  삼성전자         71900
5469  2022-02-28T00:00:00  KRX:005930  삼성전자         72100
5470  2022-03-02T00:00:00  KRX:005930  삼성전자         72000
5471  2022-03-03T00:00:00  KRX:005930  삼성전자         72800

[5472 rows x 4 columns]

In [4]:
df_samsung = pd.read_excel('./data/samsung_stock_price.xlsx', skiprows=1)

In [5]:
df_samsung.head()

                    날짜        종목코드   기업명  주가 2000-2022
0  2000-01-04T00:00:00  KRX:005930  삼성전자          6110
1  2000-01-05T00:00:00  KRX:005930  삼성전자          5580
2  2000-01-06T00:00:00  KRX:005930  삼성전자          5620
3  2000-01-07T00:00:00  KRX:005930  삼성전자          5540
4  2000-01-10T00:00:00  KRX:005930  삼성전자          5770

In [6]:
df_samsung.tail()

                       날짜        종목코드   기업명  주가 2000-2022
5467  2022-02-24T00:00:00  KRX:005930  삼성전자         71500
5468  2022-02-25T00:00:00  KRX:005930  삼성전자         71900
5469  2022-02-28T00:00:00  KRX:005930  삼성전자         72100
5470  2022-03-02T00:00:00  KRX:005930  삼성전자         72000
5471  2022-03-03T00:00:00  KRX:005930  삼성전자         72800

In [7]:
df_samsung.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5472 entries, 0 to 5471
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   날짜            5472 non-null   object
 1   종목코드          5472 non-null   object
 2   기업명           5472 non-null   object
 3   주가 2000-2022  5472 non-null   int64
dtypes: int64(1), object(3)
memory usage: 171.1+ KB

In [8]:
df_samsung.describe()

       주가 2000-2022
count   5472.000000
mean   24776.999269
std    19784.415029
min     2730.000000
25%    10340.000000
50%    16830.000000
75%    30970.000000
max    91000.000000

## 3. Conert date-string to a legitmate date type

In [9]:
df_samsung.loc[0]

날짜              2000-01-04T00:00:00
종목코드                     KRX:005930
기업명                            삼성전자
주가 2000-2022                   6110
Name: 0, dtype: object

In [10]:
df_samsung.loc[0]['날짜']

'2000-01-04T00:00:00'

In [11]:
df_samsung.loc[0, '날짜']
# It's String!

'2000-01-04T00:00:00'

In [12]:
type(df_samsung.loc[0, '날짜'])

str

In [13]:
df_samsung['날짜'] = pd.to_datetime(df_samsung['날짜'])

In [14]:
df_samsung.head()

          날짜        종목코드   기업명  주가 2000-2022
0 2000-01-04  KRX:005930  삼성전자          6110
1 2000-01-05  KRX:005930  삼성전자          5580
2 2000-01-06  KRX:005930  삼성전자          5620
3 2000-01-07  KRX:005930  삼성전자          5540
4 2000-01-10  KRX:005930  삼성전자          5770

In [15]:
df_samsung.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5472 entries, 0 to 5471
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   날짜            5472 non-null   datetime64[ns]
 1   종목코드          5472 non-null   object
 2   기업명           5472 non-null   object
 3   주가 2000-2022  5472 non-null   int64
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 171.1+ KB

# Difficulty: moderate!